tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1 0);

boundaryField
{
    inlet
    {
        type            mapped;
        field           U.liquid;
        setAverage      1;
        average         (0 1 0);
        interpolationScheme cell;
        value           uniform (0 1 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.liquid;
        value           uniform (0 1 0);
    }
    wall1
    {
        type            noSlip;
    }
    wall2
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
